ConfigurationServiceDesk/src/InformationRegisters/НастройкиSLA/НастройкиSLA.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиSLA</name>
  <resources>
    <name>ВремяРеакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяРешения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчитыватьНерабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.СервисыИТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ConfigurationServiceDesk/src/CommonModules/СерверСервисДеск/Module.bsl
#Область ПрограммныйИнтерфейс

// Рассчитывает сроки SLA на основании переданных параметров и настроек регистра.
//
// Параметры:
//  Сервис - СправочникСсылка.СервисыИТ - Выбранный ИТ-сервис.
//  Приоритет - СправочникСсылка.Приоритеты - Приоритет обращения.
//  ДатаНачала - Дата - Дата, от которой ведется расчет.
//  УчитыватьНерабочееВремя - Булево - Флаг использования производственного календаря.
//
// Возвращаемое значение:
//  Структура - содержит поля:
//      * СрокРеакции - Дата - Рассчитанный крайний срок реакции.
//      * СрокРешения - Дата - Рассчитанный крайний срок решения.
//
Функция РассчитатьSLA(Сервис, Приоритет, УчитыватьНерабочееВремя = Истина) Экспорт
    
    // Если дата не передана, берем текущую
    БазоваяДата = ТекущаяДата();
    
    Результат = Новый Структура("СрокРеакции, СрокРешения", БазоваяДата, БазоваяДата);
    
    Отбор = Новый Структура("Сервис, Приоритет", Сервис, Приоритет);
    Настройки = РегистрыСведений.НастройкиSLA.Получить(Отбор);
    
    // Если настроек нет, сроки равны дате документа
    Если Настройки.ВремяРеакции = 0 И Настройки.ВремяРешения = 0 Тогда
        Возврат Результат; 
    КонецЕсли;
    
    Если УчитыватьНерабочееВремя Тогда
        // Прибавляем время к БазоваяДата с учетом графика
        Результат.СрокРеакции = ДобавитьРабочееВремя(БазоваяДата, Настройки.ВремяРеакции * 60);
        Результат.СрокРешения = ДобавитьРабочееВремя(БазоваяДата, Настройки.ВремяРешения * 3600);
    Иначе
        // Обычное сложение дат (календарное время)
        Результат.СрокРеакции = БазоваяДата + (Настройки.ВремяРеакции * 60);
        Результат.СрокРешения = БазоваяДата + (Настройки.ВремяРешения * 3600);
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции

// Выполняет проверку превышения срока реакции и эскалацию обращения.
//
// Параметры:
//  ОбращениеСсылка - ДокументСсылка.ОбращениеПользователя - Ссылка на проверяемый документ.
//
// Возвращаемое значение:
//  Булево - Истина, если произошла эскалация; Ложь в противном случае.

Функция ПроверитьПросрочку(ОбращениеСсылка) Экспорт
  
  // Проверяем, что ссылка не пустая
  Если ОбращениеСсылка.Пустая() Тогда
    Возврат Ложь;
  КонецЕсли;
  
  ОбращениеОбъект = ОбращениеСсылка.ПолучитьОбъект();
  СтатусНовое = Справочники.СтатусыОбращений.НайтиПоНаименованию("Новое");
  
  // Проверяем условия для эскалации
  Если ОбращениеОбъект.Статус = СтатусНовое 
    И ЗначениеЗаполнено(ОбращениеОбъект.СрокРеакции) 
    И ТекущаяДата() > ОбращениеОбъект.СрокРеакции Тогда
    
    // 1. Устанавливаем критический приоритет P1
    ПриоритетP1 = Справочники.Приоритеты.НайтиПоНаименованию("P1 Критичный");
    Если Не ПриоритетP1.Пустая() Тогда
      ОбращениеОбъект.Приоритет = ПриоритетP1;
    КонецЕсли;
    
    // 2. Устанавливаем флаг просрочки
    ОбращениеОбъект.Просрочено = Истина;
    
    // 3. Сохраняем изменения
    Попытка
      ОбращениеОбъект.Записать();
      Возврат Истина;
    Исключение
      Возврат Ложь;
    КонецПопытки;
    
  КонецЕсли;
  
  Возврат Ложь;
  
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет время к дате, пропуская субботы и воскресенья.
//
Функция ДобавитьРабочееВремя(ДатаНачала, СекундыДобавления)
  
  ТекущаяДатаРасчета = ДатаНачала;
  ОсталосьСекунд = СекундыДобавления;
  
  // Цикл по часам для упрощенного учета выходных
  Пока ОсталосьСекунд > 0 Цикл
    Шаг = Мин(ОсталосьСекунд, 3600); 
    ТекущаяДатаРасчета = ТекущаяДатаРасчета + Шаг;
    ОсталосьСекунд = ОсталосьСекунд - Шаг;
    
    ДеньНед = ДеньНедели(ТекущаяДатаРасчета);
    Если ДеньНед > 5 Тогда // Суббота или Воскресенье
      // Переносим на утро понедельника (9:00)
      ДнейДоПонедельника = 8 - ДеньНед;
      ТекущаяДатаРасчета = НачалоДня(ТекущаяДатаРасчета + ДнейДоПонедельника * 86400) + 9 * 3600;
    КонецЕсли;
  КонецЦикла;
  
  Возврат ТекущаяДатаРасчета;
  
КонецФункции

#КонецОбласти
